"The name of your computer " = "Tietokoneen nimi ";
"This computer’s local hostname " = "Tietokoneen paikallinen palvelinnimi ";
"“" = "”";
"”" = "”";
" is already in use on this network. " = " on jo käytössä tässä verkossa. ";
"The name has been changed to " = "Nimeksi on muutettu ";
"." = ".";

"To change the name of your computer, open System Preferences and click Sharing, then type the name in the Computer Name field." = "Jos haluat muuttaa tietokoneen nimeä, avaa Järjestelmäasetukset, osoita Jako ja kirjoita nimi Tietokoneen nimi -kenttään.";
"To change the local hostname, open System Preferences and click Sharing, then click “Edit” and type the name in the Local Hostname field." = "Jos haluat muuttaa paikallista palvelinnimeä, avaa Järjestelmäasetukset, osoita Jako ja Muokkaa ja kirjoita nimi Paikallinen palvelinnimi -kenttään.";

"All attempts to find an available name by adding a number to the name were also unsuccessful." = "Yritykset löytää vapaa nimi lisäämällä numero nimeen epäonnistuivat.";
"This may indicate a problem with the local network. Please inform your network administrator." = "Tämä saattaa merkitä ongelmaa lähiverkossa. Ilmoita asiasta verkon ylläpitäjälle.";
